#define IN_CONSOLE_GAMES

#define IN_SOKOBAN_C
#include "sokoban.h"

/* 推箱子关卡地图编码表：
 *          墙外空白：0      墙：1
 *          墙内空白：2      箱子目标位置：3
 *          角色位置：6      角色位置箱子目标位置：7
 *          箱子位置：10     正确的箱子位置：11
 */
static const int maps[][MAP_SIZE][MAP_SIZE] = {
    // 关卡1
    {{0,0,1,1,1,},{0,0,1,3,1,},{0,0,1,2,1,1,1,1,},{1,1,1,10,2,10,3,1},
    { 1,3,2,10,6,1,1,1,},{1,1,1,1,10,1,},{0,0,0,1,3,1,},{0,0,0,1,1,1,},},
    // 关卡2
    {{1,1,1,1,1,},{1,2,2,2,1,},{1,2,10,6,1,0,1,1,1,},{1,2,10,10,1,0,1,3,1,},
    {1,1,1,2,1,1,1,3,1}, {0,1,1,2,2,2,2,3,1,},{0,1,2,2,2,1,2,2,1,},
    {0,1,2,2,2,1,1,1,1,},{0,1,1,1,1,1,},},
    // 关卡3
    {{0,1,1,1,1,},{1,1,2,2,1,},{1,2,6,10,1,},{1,1,10,2,1,1,},
    { 1,1,2,10,2,1,},{1,3,10,2,2,1,},{1,3,3,11,3,1,},{1,1,1,1,1,1,},},
    // 关卡4
    {{0,1,1,1,1,},{0,1,2,2,1,1,1,},{0,1,6,10,2,2,1,},{1,1,1,2,1,2,1,1,},
    { 1,3,1,2,1,2,2,1,},{1,3,10,2,2,1,2,1,},{1,3,2,2,2,10,2,1,},{1,1,1,1,1,1,1,1,},},
    // 关卡5
    {{0,0,1,1,1,1,1,1,},{0,0,1,2,2,2,2,1,},{1,1,1,10,10,10,2,1,},{1,6,2,10,3,3,2,1,},
    { 1,2,10,3,3,3,1,1,},{1,1,1,1,2,2,1,},{0,0,0,1,1,1,1,},},
    // 关卡6
    {{0,0,1,1,1,1,1,},{1,1,1,2,2,2,1,},{1,2,10,6,3,2,1,1,},{1,2,2,3,10,3,2,1,},
    { 1,1,1,2,11,10,2,1,},{0,0,1,2,2,2,1,1,},{0,0,1,1,1,1,1,},},
    // 关卡7
    {{0,0,1,1,1,1,},{0,0,1,3,3,1,},{0,1,1,2,3,1,1,},{0,1,2,2,10,3,1,},
    { 1,1,2,10,2,2,1,1,},{1,2,2,1,10,10,2,1,},{1,2,2,6,2,2,2,1,},{1,1,1,1,1,1,1,1,},},
    // 关卡8
    {{1,1,1,1,1,1,1,1,},{1,2,2,1,2,2,2,1,},{1,2,10,3,3,10,2,1,},{1,6,10,3,11,2,1,1,},
    { 1,2,10,3,3,10,2,1,},{1,2,2,1,2,2,2,1,},{1,1,1,1,1,1,1,1,},},
    // 关卡9
    {{1,1,1,1,1,1,},{1,2,2,2,2,1,},{1,2,10,10,10,1,1,},{1,2,2,1,3,3,1,1,1,},
    { 1,1,2,2,3,3,10,2,1,},{0,1,2,6,2,2,2,2,1,},{0,1,1,1,1,1,1,1,1,},},
    // 关卡10
    {{1,1,1,1,1,1,1,},{1,3,3,10,3,3,1,},{1,3,3,1,3,3,1,},{1,2,10,10,10,2,1,},
    { 1,2,2,10,2,2,1,},{1,2,10,10,10,2,1,},{1,2,2,1,2,6,1,},{1,1,1,1,1,1,1,},},
    // 关卡11
    {{0,1,1,1,1,1,},{0,1,2,2,6,1,1,1,},{1,1,2,1,10,2,2,1,},{1,2,11,3,2,3,2,1,},
    { 1,2,2,10,10,2,1,1,},{1,1,1,2,1,3,1,},{0,0,1,2,2,2,1,},{0,0,1,1,1,1,1,},},
    // 关卡12
    {{1,1,1,1,1,1,},{1,2,2,2,2,1,},{1,2,10,2,2,1,},{1,1,11,6,2,1,},
    {1,2,11,2,1,1,},{1,2,11,2,1,},{1,2,11,2,1,},{1,2,3,2,1,},{1,1,1,1,1,},},
    // 关卡13
    {{0,0,1,1,1,1,},{0,0,1,2,2,1,},{1,1,1,10,2,1,1,},{1,2,2,11,2,6,1,},{1,2,2,11,2,2,1,},
    { 1,2,2,11,2,1,1,},{1,1,1,11,2,1,},{0,0,1,3,1,1,},{0,0,1,1,1,},},
    // 关卡14
    {{1,1,1,1,1,},{1,2,2,2,1,1,1,1,1,},{1,2,1,2,1,2,2,2,1,},{1,2,10,2,2,2,10,2,1,},
    { 1,3,3,1,10,1,10,1,1,},{1,3,6,10,2,2,2,1,},{1,3,3,2,2,1,1,1,},{1,1,1,1,1,1,},},
    // 关卡15
    {{0,1,1,1,1,1,1,},{0,1,2,2,2,2,1,1,},{1,1,3,1,1,10,2,1,},{1,2,3,3,10,2,2,1,},
    { 1,2,2,1,10,2,2,1,},{1,2,2,6,2,1,1,1,},{1,1,1,1,1,1,},},
    // 关卡16
    {{1,1,1,1,1,1,1,},{1,3,2,3,2,3,1,},{1,2,10,10,10,2,1,},{1,3,10,6,10,3,1,},
    { 1,2,10,10,10,2,1,},{1,3,2,3,2,3,1,},{1,1,1,1,1,1,1,},},
    // 关卡17
    {{1,1,1,1,1,1,1,1,1,1,1,},{1,3,3,3,2,1,2,2,2,2,1,},{1,3,3,2,2,1,2,1,1,2,1,1,},
    { 1,3,3,2,2,2,2,2,1,2,2,1,},{1,3,3,2,2,1,2,10,1,1,2,1,},{1,3,3,3,2,1,10,2,10,2,2,1,},
    { 1,1,1,1,1,1,2,10,10,2,2,1,},{0,1,1,2,2,10,2,2,10,10,2,1,},{0,1,2,2,10,10,10,2,2,1,2,1,},
    { 0,1,1,2,10,2,1,1,2,2,2,1,},{0,0,1,2,2,2,2,2,6,2,2,1,},{0,0,1,1,1,1,1,1,1,1,1,1,},},
    // 关卡18
    {{0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,},{0,0,0,0,0,0,0,1,2,2,1,2,2,2,1,},
    {0,1,1,1,1,1,1,1,2,10,10,3,3,3,1,},{ 0,1,2,2,2,2,2,2,2,2,1,3,3,3,1,},
    {0,1,2,1,1,1,1,1,1,10,1,3,3,3,1,},{1,1,2,1,2,2,2,2,2,2,1,3,3,3,1,},
    { 1,2,2,1,2,1,10,2,10,2,1,1,1,1,1,},{1,2,1,2,10,2,10,2,10,2,1,},{1,2,6,2,2,10,2,1,2,2,1,},
    { 1,1,1,1,1,10,2,10,10,2,1,},{0,0,0,0,1,2,2,2,2,2,1,},{0,0,0,0,1,1,1,1,1,1,1,},},
    // 关卡19
    {{1,1,1,1,1,1,1,1,},{1,2,3,3,3,3,3,1,},{1,2,3,3,3,3,3,1,},{1,1,2,1,1,2,1,1,},
    {0,1,2,2,2,2,2,1,},{ 1,1,2,1,6,2,2,1,},{1,2,2,2,1,1,1,1,1,1,1,1,},
    {1,2,2,10,1,1,1,2,2,2,2,1,},{1,2,10,2,2,2,2,2,2,1,2,1,},{ 1,1,2,10,1,10,10,2,10,2,2,1,},
    {0,1,2,2,1,2,2,10,2,1,2,1,},{0,1,1,1,1,10,10,2,10,2,2,1,},{ 0,0,0,0,1,2,1,2,1,1,2,1,},
    {0,0,0,0,1,2,2,2,2,2,2,1,},{0,0,0,0,1,1,1,1,1,1,1,1,},},
    // 关卡20
    {{0,0,1,1,1,},{0,0,1,3,1,},{0,1,1,10,1,1,1,1,},{0,1,2,2,2,2,2,1,},
    {0,1,2,11,11,2,2,1,1,1,1,},{0,1,2,11,2,11,11,11,2,2,1,},{1,1,11,2,2,11,2,11,2,2,1,},
    {1,2,11,2,1,1,2,11,2,1,1,},{1,2,11,2,2,2,2,11,2,1,},{1,2,2,11,11,2,11,2,2,1,},
    {1,2,2,2,6,2,2,1,1,1,},{1,1,1,1,1,1,1,1,},},
    // 关卡21
    {{0,0,0,0,0,1,1,1,1,},{0,0,0,1,1,1,2,2,1,1,1,1,},{1,1,1,1,2,10,2,2,1,2,2,1,},
    {1,2,10,2,2,10,2,10,2,2,2,1,},{1,2,1,2,1,10,1,10,1,2,2,1,},{1,2,3,3,3,3,6,3,3,2,1,1,},
    {1,1,1,1,1,1,1,1,1,1,1,},},
    // 关卡22
    {{0,0,0,0,0,1,1,1,1,1,},{0,0,0,0,0,1,2,2,2,1,1,},{0,0,0,0,0,1,2,2,2,2,1,},
    {0,1,1,1,1,1,2,2,2,2,1,},{1,1,2,2,2,2,2,1,2,2,1,1,1,1,1,},
    {1,2,10,10,10,10,2,1,2,3,3,3,3,2,1,},{1,2,10,2,6,10,2,1,2,3,1,2,3,2,1,},
    { 1,2,10,2,2,10,2,1,2,3,2,1,3,2,1,},{1,2,10,10,10,10,2,2,2,3,3,3,3,2,1,},
    {1,2,2,2,2,2,2,1,1,1,1,1,2,2,1,},{1,1,1,1,1,1,1,1,0,0,0,1,1,1,1,},},
    // 关卡23
    {{1,1,1,1,1,1,1,1,1,1,1,1,},{1,3,3,3,3,3,3,3,3,3,3,1,},{1,2,1,2,1,1,1,1,1,10,2,1,},
    {1,2,10,2,1,3,3,3,1,2,2,1,},{1,2,1,2,1,2,10,11,1,10,2,1,},{1,2,10,2,1,2,2,2,1,2,2,1,},
    {1,2,1,2,1,10,10,10,1,10,2,1,},{1,2,10,2,1,2,2,2,1,2,2,1,},{1,2,1,2,1,3,11,3,1,10,2,1,},
    {1,2,10,2,1,3,3,3,1,2,2,1,},{1,2,1,2,1,10,10,10,1,10,2,1,},{1,2,10,2,2,10,6,11,2,2,2,1,},
    { 1,1,1,1,1,1,1,1,2,2,2,1,},{0,0,0,0,0,0,0,1,1,1,1,1,},},
    // 关卡24
    {{0,0,0,1,1,1,1,1,1,1,1,1,1,1,},{0,1,1,1,1,6,2,2,2,2,2,2,2,1,},
    {0,1,2,2,2,2,10,10,10,10,10,10,2,1,},{0,1,2,1,1,1,2,2,2,2,2,2,1,1,},
    {1,1,2,1,1,1,2,10,10,10,10,2,1,},{1,3,3,1,1,1,1,2,2,2,2,1,1,},
    {1,3,11,3,3,1,1,2,10,10,2,1,},{1,3,11,3,10,2,2,1,2,2,1,1,},{1,3,11,3,10,2,10,2,2,2,1,},
    {1,3,11,3,10,2,10,2,2,1,1,},{1,3,11,3,10,2,10,2,2,1,},{1,3,11,3,10,2,2,1,1,1,},
    {1,3,11,3,3,1,1,1,},{1,3,3,1,1,1,},{1,1,1,1,},},
    // 关卡25
    {{1,1,1,1,1,1,1,1,1,},{1,2,2,2,2,2,2,2,1,},{1,2,2,2,2,2,2,2,1,1,1,1,},
    {1,1,2,1,1,1,1,2,1,2,2,1,},{ 1,1,2,1,6,1,1,2,2,2,2,1,},{1,2,10,10,10,2,10,2,2,10,10,1,},
    {1,2,2,1,2,1,1,2,10,2,2,1,},{ 1,2,2,1,2,1,1,2,2,10,2,1,1,1,1,},
    {1,1,1,1,2,2,10,10,10,2,10,1,2,2,1,},{0,1,2,2,2,1,1,2,2,2,3,3,3,3,1,},
    { 0,1,2,1,2,2,2,1,2,1,3,3,2,3,1,},{0,1,2,2,2,1,2,1,2,1,1,3,3,3,1,},
    {0,1,1,1,1,1,2,10,2,2,1,3,3,3,1,},{0,0,0,0,0,1,1,2,2,2,1,1,1,1,1,},
    {0,0,0,0,0,0,1,1,1,1,1,},},
    };
// 最大关卡数
static const int max_level = (sizeof maps) / (sizeof maps[0]);

/* 主函数 */
int main(void)
{
    Sokoban sb;
    sb.is_first = 1;
    
    while (1) {
        init_data(&sb);        // 数据初始化
        draw_face(&sb);        // 绘制界面
        while (!sb.winner && !sb.restart && !sb.is_return) {
            resolve_key(&sb);  // 按键处理
        }
        if (sb.winner)
            game_over(&sb);    // 游戏结束
        if (sb.is_return)
            break;
    }
    
    return 0;
}

/* 初始化数据 */
static void init_data(Sokoban *sb)
{
    int i, j;

    sb->step = 0;
    sb->winner = 0;
    sb->solve_count = 0;
    sb->box_count = 0;
    sb->restart = 0;
    sb->is_return = 0;

    if (sb->is_first) {
        sb->is_first = 0;
        sb->level = 0;
    }

    // 加载当前关卡的地图
    for (i = 0; i < MAP_SIZE; i++)
        for (j = 0; j < MAP_SIZE; j++) {
            sb->map[i][j] = maps[sb->level][i][j];
            if (sb->map[i][j] == 6 || sb->map[i][j] == 7)
                sb->cursor_x = i, sb->cursor_y = j; // 找到角色的位置
            if (sb->map[i][j] > 9)
                sb->box_count++;                // 统计箱子总数
            if (sb->map[i][j] == 11)
                sb->solve_count++;              // 统计位置正确的的箱子数
        }
}

/* 绘制游戏界面 */
static void draw_face(Sokoban *sb)
{
    int i, j;
    // 窗口设置
    set_origin(2, 1);
    set_axis(2, 1);
    set_size(35, 17);
    fill_color(BK_CLR, TSTR_CLR);
    set_title("控制台小游戏 - 推箱子");
    clrscr();
    // 绘制地图
    for (i = 0; i < MAP_SIZE; i++)
        for (j = 0; j < MAP_SIZE; j++)
            if (sb->map[i][j])
                draw_map_pos(sb, i, j);
    // 绘制游戏说明信息
    set_color(BK_CLR, TSTR_CLR);
    gotoxy(18, 0);   strprint("控制台小游戏 -- 推箱子");
    set_color(BK_CLR, ASTR_CLR);
    gotoxy(16, 1);   strprint("作者：Ma Xiaobo");
    gotoxy(16, 2);   strprint("日期：2018-8");
    set_color(BK_CLR, FSTR_CLR);
    gotoxy(16, 3);   strprint("按键说明：");
    gotoxy(16, 4);   strprint("    WSAD/方向键：移动");
    gotoxy(16, 5);   strprint("    R键：上一关  X键：下一关");
    gotoxy(16, 6);   strprint("    M键：重新开始本关");
    gotoxy(16, 7);   strprint("    Z键：后退  Q键：返回主菜单");
    show_game_info(sb);       // 绘制游戏信息
    gotoxy(sb->cursor_x, sb->cursor_y);
}

/* 角色移动 */
static void move(Sokoban *sb, int dx, int dy)
{
    int next_pos = sb->map[sb->cursor_x + dx][sb->cursor_y + dy];

    if (next_pos == 1)        // 前方是墙
        return;
    else if (next_pos > 9) {  // 前方是箱子
        int third_pos = sb->map[sb->cursor_x + 2 * dx][sb->cursor_y + 2 * dy];
        if (third_pos == 2 || third_pos == 3) {    // 箱子可以移动
            if (next_pos == 10 && third_pos == 3)  // 箱子被移动正确的位置上
                sb->solve_count++;
            if (next_pos == 11 && third_pos == 2)  // 箱子从正确位置移动到非正确位置上
                sb->solve_count--;

            sb->map[sb->cursor_x + 2 * dx][sb->cursor_y + 2 * dy] += 8;
            sb->map[sb->cursor_x + dx][sb->cursor_y + dy] -= 4;
            sb->undo_dir[sb->step++] = 100 + (dx + 1) * 10 + (dy + 1); // 记录步骤，用于撤销
            draw_map_pos(sb, sb->cursor_x + 2 * dx, sb->cursor_y + 2 * dy);
        } else             // 箱子无法移动
            return;
    } else {               // 前方不是箱子
        sb->map[sb->cursor_x + dx][sb->cursor_y + dy] += 4;
        sb->undo_dir[sb->step++] = (dx + 1) * 10 + (dy + 1);  // 记录步骤，用于撤销
    }

    sb->map[sb->cursor_x][sb->cursor_y] -= 4;
    draw_map_pos(sb, sb->cursor_x + dx, sb->cursor_y + dy);
    draw_map_pos(sb, sb->cursor_x, sb->cursor_y);
    sb->cursor_x += dx;
    sb->cursor_y += dy;
    gotoxy(sb->cursor_x, sb->cursor_y);
    // 箱子均正确，游戏结束
    if (sb->solve_count == sb->box_count)
        sb->winner = 1;
    show_game_info(sb);
    gotoxy(sb->cursor_x, sb->cursor_y);
}

/* 撤销 */
static void undo(Sokoban *sb)
{
    int km, dx, dy;
    if (sb->step <= 0)
        return;

    sb->step--;
    km = sb->undo_dir[sb->step] / 100;         // 是否要移动箱子
    dx = sb->undo_dir[sb->step] / 10 % 10 - 1; // 角色的x坐标
    dy = sb->undo_dir[sb->step] % 10 - 1;      // 角色的y坐标
    // 箱子需要移动
    if (km) {
        if (sb->map[sb->cursor_x + dx][sb->cursor_y + dy] == 10 && sb->map[sb->cursor_x][sb->cursor_y] == 7)
            sb->solve_count++;
        if (sb->map[sb->cursor_x + dx][sb->cursor_y + dy] == 11 && sb->map[sb->cursor_x][sb->cursor_y] == 6)
            sb->solve_count--;
        sb->map[sb->cursor_x + dx][sb->cursor_y + dy] -= 8;
        sb->map[sb->cursor_x][sb->cursor_y] += 8;
        draw_map_pos(sb, sb->cursor_x + dx, sb->cursor_y + dy);
    }
    // 撤销
    sb->map[sb->cursor_x][sb->cursor_y] -= 4;
    draw_map_pos(sb, sb->cursor_x, sb->cursor_y);
    sb->cursor_x -= dx, sb->cursor_y -= dy;
    sb->map[sb->cursor_x][sb->cursor_y] += 4;
    draw_map_pos(sb, sb->cursor_x, sb->cursor_y);
    show_game_info(sb);
    gotoxy(sb->cursor_x, sb->cursor_y);
}

/* 处理按键 */
static void resolve_key(Sokoban *sb)
{
    switch (get_key(1)) {
   // 方向键/WSAD建移动角色
    case KEY_UP:    case 'W': move(sb, 0, -1); break;
    case KEY_DOWN:  case 'S': move(sb, 0, 1);  break;
    case KEY_LEFT:  case 'A': move(sb, -1, 0); break;
    case KEY_RIGHT: case 'D': move(sb, 1, 0);  break;
    // 功能键
    case 'Q': sb->is_return = 1;        // 返回主菜单
    case 'Z': undo(sb); return;           // 撤销
    case 'M': sb->restart = 1; return;  // 重新开始
    case 'R':                           // 上一关
        sb->restart = 1;
        sb->level = (max_level + sb->level - 1) % max_level;
        return;
    case 'X':                       // 下一关
        sb->restart = 1;
        sb->level = (sb->level + 1) % max_level;
        return;
    }
    gotoxy(sb->cursor_x, sb->cursor_y);
}

/* 绘制地图编码代表的食物 */
static void draw_map_pos(Sokoban *sb, int x, int y)
{
    gotoxy(x, y);
    switch (sb->map[x][y]) {
    case 0:  set_color(BK_CLR,      M00_CLR); strprint("  "); break;  // 墙外空白
    case 1:  set_color(WALL_BK_CLR, M01_CLR); strprint("▓"); break;   // 墙
    case 2:  set_color(MAP_BK_CLR,  M02_CLR); strprint("  "); break;  // 墙内空白
    case 3:  set_color(MAP_BK_CLR,  M03_CLR); strprint("×"); break;   //箱子目标位置
    case 6:  set_color(MAP_BK_CLR,  M06_CLR); strprint("★"); break;  // 角色位置
    case 7:  set_color(MAP_BK_CLR,  M07_CLR); strprint("★"); break;  // 角色位置箱子目标位置
    case 10: set_color(MAP_BK_CLR,  M10_CLR); strprint("■"); break;   // 箱子位置
    case 11: set_color(MAP_BK_CLR,  M11_CLR); strprint("■"); break;   // 正确的箱子位置
    }
    gotoxy(x, y);
}

/* 显示游戏信息 */
static void show_game_info(Sokoban *sb)
{
    set_color(BK_CLR, ISTR_CLR);
    gotoxy(25, 9);  strprint("总关卡数：  %d  ", max_level);
    gotoxy(16, 9);  strprint("当前关卡：  %d  ", sb->level + 1);
    gotoxy(25, 10); strprint("箱子数：    %d  ", sb->box_count);
    gotoxy(16, 10); strprint("正确箱子数：%d  ", sb->solve_count);
    gotoxy(16, 11); strprint("当前步数：  %d  ", sb->step);
}

/* 游戏结束 */
static void game_over(Sokoban *sb)
{
    int ch;

    set_color(BK_CLR, OSTR_CLR);
    gotoxy(16, 13); strprint(" 恭喜通关！");
    set_color(OBK_CLR, OSTR_CLR);
    gotoxy(16, 14); strprint(" 按回车键进入下一关 ");
    gotoxy(16, 15); strprint(" 按Q键返回主菜单    ");

    while ((ch = get_key(1)) != KEY_ENTER)      // 等待按键
        if (ch == 'Q') {
            sb->is_return = 1;                      // 按Q键返回主菜单
            break;
        }
    sb->level = (sb->level + 1) % max_level;            // 进入下一关
}
